#ifndef __RT_THREAD_H__
#define __RT_THREAD_H__

#include "rtdef.h"
#include "rtconfig.h"
#include "rtservice.h"
#include "rthw.h"


/*
-------------------------------------------------------------------------
*                               内核对象接口
-------------------------------------------------------------------------
*/
void rt_object_init(struct rt_object         *object,
                    enum rt_object_class_type type,
                    const char               *name);

										
								
/*
-------------------------------------------------------------------------
*                               线程接口
-------------------------------------------------------------------------
*/
rt_err_t rt_thread_init(struct rt_thread *thread,
												const char *name,
												void (*entry)(void *parameter),
												void *parameter,
												void *stack_start,
												rt_uint32_t stack_size);

/* 使用空闲线程延时 */
void rt_thread_delay(rt_tick_t tick);			

/*
-------------------------------------------------------------------------
*                             调度器接口
-------------------------------------------------------------------------
*/
/* 初始化系统调度器 */
void rt_system_scheduler_init(void);
/* 启动系统调度器 */
void rt_system_scheduler_start(void);
/* 手动任务切换 */										
void rt_schedule(void);
												
								/*
-------------------------------------------------------------------------
*                             空闲线程接口
-------------------------------------------------------------------------
*/                        
void rt_thread_idle_init(void);


/*
-------------------------------------------------------------------------
*                             中断接口
-------------------------------------------------------------------------
*/                        
void rt_interrupt_enter(void);
void rt_interrupt_leave(void);

/*
-------------------------------------------------------------------------
*                             时钟相关接口
-------------------------------------------------------------------------
*/ 
void rt_tick_increase(void);

												
/*
-------------------------------------------------------------------------
*                             内核服务相关函数接口
-------------------------------------------------------------------------
*/                        
                        
char *rt_strncpy(char *dst, const char *src, rt_ubase_t n);    
#endif
